Revit 2024 API
BuiltInFailures.BeamFailures Class
 Failures about Beams.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class BeamFailures
Visual Basic
Public NotInheritable Class BeamFailures
Visual C++
public ref class BeamFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.BeamFailures
See Also
BuiltInFailures.BeamFailures Members
Autodesk.Revit.DB Namespace